luyuxuan77/MSPM0_G3519/User/config.syscfg
GPIO4.$name                         = "LED";
GPIO4.associatedPins.create(2);
GPIO4.associatedPins[0].$name       = "L1";
GPIO4.associatedPins[0].pin.$assign = "PB19";
GPIO4.associatedPins[1].$name       = "L2";
GPIO4.associatedPins[1].pin.$assign = "PC7";

GPIO5.$name                         = "KEYBoard";
GPIO5.associatedPins.create(8);
GPIO5.associatedPins[0].$name       = "H1";
GPIO5.associatedPins[0].pin.$assign = "PB20";
GPIO5.associatedPins[1].$name       = "H2";
GPIO5.associatedPins[1].pin.$assign = "PB23";
GPIO5.associatedPins[2].$name       = "H3";
GPIO5.associatedPins[2].pin.$assign = "PB24";
GPIO5.associatedPins[3].$name       = "H4";
GPIO5.associatedPins[3].pin.$assign = "PB25";
GPIO5.associatedPins[4].$name       = "V1";
GPIO5.associatedPins[4].pin.$assign = "PB26";
GPIO5.associatedPins[5].$name       = "V2";
GPIO5.associatedPins[5].pin.$assign = "PB27";
GPIO5.associatedPins[6].$name       = "V3";
GPIO5.associatedPins[6].pin.$assign = "PC8";
GPIO5.associatedPins[7].$name       = "V4";
GPIO5.associatedPins[7].pin.$assign = "PC9";

GPIO6.$name                         = "Other";
GPIO6.associatedPins[0].$name       = "BINT";
GPIO6.associatedPins[0].pin.$assign = "PC1";

GPIO7.$name                          = "IMU";
GPIO7.associatedPins.create(3);
GPIO7.associatedPins[0].$name        = "INT1";
GPIO7.associatedPins[0].direction    = "INPUT";
GPIO7.associatedPins[0].pin.$assign  = "PC2";
GPIO7.associatedPins[1].$name        = "INT2";
GPIO7.associatedPins[1].direction    = "INPUT";
GPIO7.associatedPins[1].pin.$assign  = "PC3";
GPIO7.associatedPins[2].$name        = "CS";
GPIO7.associatedPins[2].initialValue = "SET";
GPIO7.associatedPins[2].pin.$assign  = "PC4";

MCAN1.$name                    = "MCAN0";
MCAN1.fdMode                   = false;
MCAN1.rrfe                     = true;
MCAN1.rrfs                     = true;
MCAN1.rxBufElemSize            = "DL_MCAN_ELEM_SIZE_8BYTES";
MCAN1.rxFIFO0ElemSize          = "DL_MCAN_ELEM_SIZE_8BYTES";
MCAN1.rxFIFO1ElemSize          = "DL_MCAN_ELEM_SIZE_8BYTES";
MCAN1.stdFiltType              = "00";
MCAN1.stdFiltElem              = "001";
MCAN1.stdFiltID2               = 2047;
MCAN1.lse                      = 0;
MCAN1.txBufNum                 = 1;
MCAN1.txEventFIFOSize          = 0;
MCAN1.txEventFIFOWaterMark     = 0;
MCAN1.rxFIFO0waterMark         = 0;
MCAN1.rxFIFO1size              = 0;
MCAN1.txStartAddr              = 16;
MCAN1.rxFIFO0startAddr         = 96;
MCAN1.rxFIFO1startAddr         = 144;
MCAN1.rxBufStartAddr           = 160;
MCAN1.peripheral.rxPin.$assign = "PA13";
MCAN1.peripheral.txPin.$assign = "PA12";
MCAN1.txPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric6";
MCAN1.rxPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric7";

PWM1.$name                      = "PWM_0";
PWM1.peripheral.ccp0Pin.$assign = "PA8";
PWM1.peripheral.ccp1Pin.$assign = "PA9";
PWM1.PWM_CHANNEL_0.$name        = "ti_driverlib_pwm_PWMTimerCC0";
PWM1.PWM_CHANNEL_1.$name        = "ti_driverlib_pwm_PWMTimerCC1";
PWM1.ccp0PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric2";
PWM1.ccp1PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric3";

PWM2.$name                      = "PWM_1";
PWM2.peripheral.ccp0Pin.$assign = "PA15";
PWM2.peripheral.ccp1Pin.$assign = "PA16";
PWM2.PWM_CHANNEL_0.$name        = "ti_driverlib_pwm_PWMTimerCC2";
PWM2.PWM_CHANNEL_1.$name        = "ti_driverlib_pwm_PWMTimerCC3";
PWM2.ccp0PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric8";
PWM2.ccp1PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric9";

PWM3.$name                              = "MOTOR_PWM";
PWM3.ccIndex                            = [0,1,2,3];
PWM3.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC4";
PWM3.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC5";
PWM3.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM3.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM3.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM3.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM3.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric16";
PWM3.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM3.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM3.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM3.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM3.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric17";
PWM3.peripheral.ccp0Pin.$assign         = "PA29";
PWM3.peripheral.ccp1Pin.$assign         = "PA30";
PWM3.peripheral.ccp2Pin.$assign         = "PA28";
PWM3.peripheral.ccp3Pin.$assign         = "PB1";
PWM3.PWM_CHANNEL_2.$name                = "ti_driverlib_pwm_PWMTimerCC6";
PWM3.PWM_CHANNEL_3.$name                = "ti_driverlib_pwm_PWMTimerCC7";
PWM3.ccp2PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric18";
PWM3.ccp3PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric19";

QEI1.$name                              = "QEI_M1";
QEI1.peripheral.ccp0Pin.$assign         = "PB29";
QEI1.peripheral.ccp1Pin.$assign         = "PB30";
QEI1.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
QEI1.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
QEI1.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
QEI1.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric29";
QEI1.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
QEI1.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
QEI1.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
QEI1.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric30";

QEI2.$name                      = "QEI_1";
QEI2.peripheral.ccp0Pin.$assign = "PC6";
QEI2.peripheral.ccp1Pin.$assign = "PA22";
QEI2.ccp0PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric31";
QEI2.ccp1PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric32";

SPI1.$name                              = "SPI_1";
SPI1.frameFormat                        = "MOTO3";
SPI1.polarity                           = "1";
SPI1.phase                              = "1";
SPI1.targetBitRate                      = 2000000;
SPI1.sclkPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI1.sclkPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.sclkPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.sclkPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric24";
SPI1.mosiPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI1.mosiPinConfig.hideOutputInversion  = scripting.forceWrite(false);
SPI1.mosiPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.mosiPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.mosiPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric25";
SPI1.misoPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.misoPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.misoPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric26";
SPI1.peripheral.$assign                 = "SPI1";
SPI1.peripheral.sclkPin.$assign         = "PB16";
SPI1.peripheral.mosiPin.$assign         = "PB15";
SPI1.peripheral.misoPin.$assign         = "PB14";

SPI2.$name                              = "SPI_0";
SPI2.frameFormat                        = "MOTO3";
SPI2.polarity                           = "1";
SPI2.phase                              = "1";
SPI2.direction                          = "PICO";
SPI2.sclkPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI2.sclkPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI2.sclkPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI2.sclkPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric27";
SPI2.mosiPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI2.mosiPinConfig.hideOutputInversion  = scripting.forceWrite(false);
SPI2.mosiPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI2.mosiPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI2.mosiPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric28";
SPI2.peripheral.$assign                 = "SPI0";
SPI2.peripheral.sclkPin.$assign         = "PB18";
SPI2.peripheral.mosiPin.$assign         = "PB17";

SYSCTL.forceDefaultClkConfig = true;
SYSCTL.clockTreeEn           = true;

